Oryx-Embedded/CycloneTCP/drivers/mac/mimxrt1052_eth_driver.c
/**
 * @file mimxrt1052_eth_driver.c
 * @brief i.MX RT1050 Ethernet MAC controller
 *
 * @section License
 *
 * Copyright (C) 2010-2018 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneTCP Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 1.9.0
 **/

//Switch to the appropriate trace level
#define TRACE_LEVEL NIC_TRACE_LEVEL

//Dependencies
#include "fsl_device_registers.h"
#include "fsl_gpio.h"
#include "fsl_iomuxc.h"
#include "core/net.h"
#include "drivers/mac/mimxrt1052_eth_driver.h"
#include "debug.h"

//Underlying network interface
static NetInterface *nicDriverInterface;

//IAR EWARM compiler?
#if defined(__ICCARM__)

//TX buffer
#pragma data_alignment = 16
#pragma location = ".ram_no_cache"
static uint8_t txBuffer[MIMXRT1052_ETH_TX_BUFFER_COUNT][MIMXRT1052_ETH_TX_BUFFER_SIZE];
//RX buffer
#pragma data_alignment = 16
#pragma location = ".ram_no_cache"
static uint8_t rxBuffer[MIMXRT1052_ETH_RX_BUFFER_COUNT][MIMXRT1052_ETH_RX_BUFFER_SIZE];
//TX buffer descriptors
#pragma data_alignment = 16
#pragma location = ".ram_no_cache"
static uint32_t txBufferDesc[MIMXRT1052_ETH_TX_BUFFER_COUNT][8];
//RX buffer descriptors
#pragma data_alignment = 16
#pragma location = ".ram_no_cache"
static uint32_t rxBufferDesc[MIMXRT1052_ETH_RX_BUFFER_COUNT][8];

//ARM or GCC compiler?
#else

//TX buffer
static uint8_t txBuffer[MIMXRT1052_ETH_TX_BUFFER_COUNT][MIMXRT1052_ETH_TX_BUFFER_SIZE]
   __attribute__((aligned(16), __section__(".ram_no_cache")));
//RX buffer
static uint8_t rxBuffer[MIMXRT1052_ETH_RX_BUFFER_COUNT][MIMXRT1052_ETH_RX_BUFFER_SIZE]
   __attribute__((aligned(16), __section__(".ram_no_cache")));
//TX buffer descriptors
static uint32_t txBufferDesc[MIMXRT1052_ETH_TX_BUFFER_COUNT][8]
   __attribute__((aligned(16), __section__(".ram_no_cache")));
//RX buffer descriptors
static uint32_t rxBufferDesc[MIMXRT1052_ETH_RX_BUFFER_COUNT][8]
   __attribute__((aligned(16), __section__(".ram_no_cache")));

#endif

//TX buffer index
static uint_t txBufferIndex;
//RX buffer index
static uint_t rxBufferIndex;


/**
 * @brief i.MX RT1052 Ethernet MAC driver
 **/

const NicDriver mimxrt1052EthDriver =
{
   NIC_TYPE_ETHERNET,
   ETH_MTU,
   mimxrt1052EthInit,
   mimxrt1052EthTick,
   mimxrt1052EthEnableIrq,
   mimxrt1052EthDisableIrq,
   mimxrt1052EthEventHandler,
   mimxrt1052EthSendPacket,
   mimxrt1052EthUpdateMacAddrFilter,
   mimxrt1052EthUpdateMacConfig,
   mimxrt1052EthWritePhyReg,
   mimxrt1052EthReadPhyReg,
   TRUE,
   TRUE,
   TRUE,
   FALSE
};


/**
 * @brief i.MX RT1052 Ethernet MAC initialization
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t mimxrt1052EthInit(NetInterface *interface)
{
   error_t error;
   uint32_t value;

   //Debug message
   TRACE_INFO("Initializing i.MX RT1052 Ethernet MAC...\r\n");

   //Save underlying network interface
   nicDriverInterface = interface;

   //Enable ENET peripheral clock
   CLOCK_EnableClock(kCLOCK_Enet);

   //GPIO configuration
   mimxrt1052EthInitGpio(interface);

   //Reset ENET module
   ENET->ECR = ENET_ECR_RESET_MASK;
   //Wait for the reset to complete
   while(ENET->ECR & ENET_ECR_RESET_MASK);

   //Receive control register
   ENET->RCR = ENET_RCR_MAX_FL(1518) | ENET_RCR_RMII_MODE_MASK |
      ENET_RCR_MII_MODE_MASK;

   //Transmit control register
   ENET->TCR = 0;
   //Configure MDC clock frequency
   ENET->MSCR = ENET_MSCR_HOLDTIME(10) | ENET_MSCR_MII_SPEED(120);

   //PHY transceiver initialization
   error = interface->phyDriver->init(interface);
   //Failed to initialize PHY transceiver?
   if(error)
      return error;

   //Set the MAC address (upper 16 bits)
   value = interface->macAddr.b[5];
   value |= (interface->macAddr.b[4] << 8);
   ENET->PAUR = ENET_PAUR_PADDR2(value) | ENET_PAUR_TYPE(0x8808);

   //Set the MAC address (lower 32 bits)
   value = interface->macAddr.b[3];
   value |= (interface->macAddr.b[2] << 8);
   value |= (interface->macAddr.b[1] << 16);
   value |= (interface->macAddr.b[0] << 24);
   ENET->PALR = ENET_PALR_PADDR1(value);

   //Hash table for unicast address filtering
   ENET->IALR = 0;
   ENET->IAUR = 0;
   //Hash table for multicast address filtering
   ENET->GALR = 0;
   ENET->GAUR = 0;

   //Disable transmit accelerator functions
   ENET->TACC = 0;
   //Disable receive accelerator functions
   ENET->RACC = 0;

   //Use enhanced buffer descriptors
   ENET->ECR = ENET_ECR_DBSWP_MASK | ENET_ECR_EN1588_MASK;
   //Clear MIC counters
   ENET->MIBC = ENET_MIBC_MIB_CLEAR_MASK;

   //Initialize buffer descriptors
   mimxrt1052EthInitBufferDesc(interface);

   //Clear any pending interrupts
   ENET->EIR = 0xFFFFFFFF;
   //Enable desired interrupts
   ENET->EIMR = ENET_EIMR_TXF_MASK | ENET_EIMR_RXF_MASK | ENET_EIMR_EBERR_MASK;

   //Set priority grouping (4 bits for pre-emption priority, no bits for subpriority)
   NVIC_SetPriorityGrouping(MIMXRT1052_ETH_IRQ_PRIORITY_GROUPING);

   //Configure ENET interrupt priority
   NVIC_SetPriority(ENET_IRQn, NVIC_EncodePriority(MIMXRT1052_ETH_IRQ_PRIORITY_GROUPING,
      MIMXRT1052_ETH_IRQ_GROUP_PRIORITY, MIMXRT1052_ETH_IRQ_SUB_PRIORITY));

   //Enable Ethernet MAC
   ENET->ECR |= ENET_ECR_ETHEREN_MASK;
   //Instruct the DMA to poll the receive descriptor list
   ENET->RDAR = ENET_RDAR_RDAR_MASK;

